Revit 2027 API
BuiltInFailures.DimensionFailures.DimensionUnlocked Property
 Dimension had to be un-EQed in order to remove sketch over-constraining.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DimensionUnlocked { get; }
Public Shared ReadOnly Property DimensionUnlocked As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DimensionUnlocked {
	FailureDefinitionId^ get ();
}
static member DimensionUnlocked : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace